README.md
```mermaid
flowchart LR
    VISITANT(["Visitant"])
    CLIENT(["CLIENT"])
    ADMIN(["ADMIN"])

    subgraph pub ["Accés públic"]
        UC1("Veure portada")
        UC2("Iniciar sessió")
        UC3("Registrar-se")
    end

    subgraph cli ["Zona CLIENT"]
        UC4("Veure cartellera")
        UC5("Veure detall pel·lícula")
        UC6("Veure projeccions")
        UC7("Seleccionar seients")
        UC8("Gestionar carret")
        UC9("Comprar entrades")
        UC10("Veure entrades comprades")
        UC11("Sol·licitar devolució")
    end

    subgraph adm ["Zona ADMIN"]
        UC12("Gestionar cinemes")
        UC13("Gestionar sales")
        UC14("Gestionar seients")
        UC15("Gestionar pel·lícules")
        UC16("Gestionar projeccions")
        UC17("Confirmar / Rebutjar devolucions")
        UC18("Tancar sessió")
    end

    VISITANT --> UC1 & UC2 & UC3

    CLIENT --> UC4 & UC5 & UC6
    CLIENT --> UC7 --> UC8 --> UC9
    CLIENT --> UC10 --> UC11
    CLIENT --> UC18

    ADMIN --> UC4 & UC5 & UC6
    ADMIN --> UC12 & UC13 & UC14 & UC15 & UC16
    ADMIN --> UC17
    ADMIN --> UC18
```
